ATACseqdataPreparation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>"prepare ATAC-seq data from Luca/Pique-Regi lab for analysis"</title>
<!-- 2016-11-01 Tue 12:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Heejung Shim" />
</head>
<body>
<div id="content">
<h1 class="title">"prepare ATAC-seq data from Luca/Pique-Regi lab for analysis"</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Copy new ATAC-seq data from Luca/Pique-Regi lab to the rice cluster</a></li>
<li><a href="#sec-2">2. Convert bam file to hdf5 format</a>
<ul>
<li><a href="#sec-2-1">2.1. Prepare directory and install genome library, samtools, and python</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Create directory</a></li>
<li><a href="#sec-2-1-2">2.1.2. Install genome library</a></li>
<li><a href="#sec-2-1-3">2.1.3. Install samtools</a></li>
<li><a href="#sec-2-1-4">2.1.4. Install python</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Copy chromosome.h5 file to rice cluster</a></li>
<li><a href="#sec-2-3">2.3. Filter reads with low alignment quality 10</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. Create directory to save preprocessed bam files</a></li>
<li><a href="#sec-2-3-2">2.3.2. Filter reads with low alignment quality 10</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. Index filtered bam files</a></li>
<li><a href="#sec-2-5">2.5. Convert filtered bam files into hdf5</a></li>
<li><a href="#sec-2-6">2.6. Obtain library read depth</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Copy new ATAC-seq data from Luca/Pique-Regi lab to the rice cluster</h2>
<div class="outline-text-2" id="text-1">
<p>
Create directories in the rice cluster to save ATAC-seq data:
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/d/shared_data/internal_restricted/
mkdir atacseq_Luca_PiqueRegi
mkdir atacseq_Luca_PiqueRegi/rawbamfiles
mkdir atacseq_Luca_PiqueRegi/info
</pre>
</div>

<p>
Copy infomation on each file:
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/d/shared_data/internal_restricted/atacseq_Luca_PiqueRegi/
scp gb9571@grid.wayne.edu:/nfs/rprscratch/atac.lcl/deseq/cv.txt info/
</pre>
</div>

<p>
Copy bam files:
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/d/shared_data/internal_restricted/atacseq_Luca_PiqueRegi/
scp gb9571@grid.wayne.edu:/nfs/rprscratch/atac.lcl/merge/*.bam rawbamfiles/
</pre>
</div>

<p>
Copy merged bam files:
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/d/shared_data/internal_restricted/atacseq_Luca_PiqueRegi/
scp gb9571@grid.wayne.edu:/nfs/rprscratch/atac.lcl/mergeReps/*.bam rawbamfiles/
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Convert bam file to hdf5 format</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Prepare directory and install genome library, samtools, and python</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Create directory</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Create directory to save hdf5 files:
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/d/shared_data/internal/
mkdir hdf5
cd hdf5
mkdir hg19
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Install genome library</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Clone Graham's genome repo and follow his instruction.
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/d/hjshim/software/genome
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Install samtools</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Download samtools on rice cluster:
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/software/source/
wget https://github.com/samtools/samtools/releases/download/1.3.1/samtools-1.3.1.tar.bz2
tar -vxjf samtools-1.3.1.tar.bz2
cd samtools-1.3.1
make
</pre>
</div>

<p>
Install it on rice cluster:
</p>
<div class="org-src-container">

<pre class="src src-bash">make prefix=~/software/install/samtools-1.3.1 install
</pre>
</div>

<p>
Make a symbolic link:
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/bin
ln -s ~/software/install/samtools-1.3.1/bin/* .
ls -al
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Install python</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">

<pre class="src src-bash">module add python
pip install pysam --user
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Copy chromosome.h5 file to rice cluster</h3>
<div class="outline-text-3" id="text-2-2">
<p>
I will copy the in PPS cluster to rice cluster here:
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/d/shared_data/internal/hdf5/hg19/
</pre>
</div>

<p>
Now login into PPS cluster and copy chromosome.h5 file:
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /data/internal/genome_db/hg19/
scp chromosome.h5 hjshim@rice.rcac.purdue.edu:/home/hjshim/d/shared_data/internal/hdf5/hg19/
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Filter reads with low alignment quality 10</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Create directory to save preprocessed bam files</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/d/shared_data/internal_restricted/atacseq_Luca_PiqueRegi/
mkdir processedbamfiles
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Filter reads with low alignment quality 10</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/d/shared_data/internal_restricted/atacseq_Luca_PiqueRegi/rawbamfiles/

samtools view -b -q 10 AT2-N701-N501.bam &gt; ../processedbamfiles/AT2-N701-N501.qfiltered10.bam
samtools view -b -q 10 AT2-N701-N502.bam &gt; ../processedbamfiles/AT2-N701-N502.qfiltered10.bam
samtools view -b -q 10 AT2-N701-N503.bam &gt; ../processedbamfiles/AT2-N701-N503.qfiltered10.bam

samtools view -b -q 10 AT2-N702-N501.bam &gt; ../processedbamfiles/AT2-N702-N501.qfiltered10.bam
samtools view -b -q 10 AT2-N702-N502.bam &gt; ../processedbamfiles/AT2-N702-N502.qfiltered10.bam
samtools view -b -q 10 AT2-N702-N503.bam &gt; ../processedbamfiles/AT2-N702-N503.qfiltered10.bam

samtools view -b -q 10 AT2-N703-N501.bam &gt; ../processedbamfiles/AT2-N703-N501.qfiltered10.bam
samtools view -b -q 10 AT2-N703-N502.bam &gt; ../processedbamfiles/AT2-N703-N502.qfiltered10.bam
samtools view -b -q 10 AT2-N703-N503.bam &gt; ../processedbamfiles/AT2-N703-N503.qfiltered10.bam

samtools view -b -q 10 AT2-N704-N501.bam &gt; ../processedbamfiles/AT2-N704-N501.qfiltered10.bam
samtools view -b -q 10 AT2-N704-N502.bam &gt; ../processedbamfiles/AT2-N704-N502.qfiltered10.bam
samtools view -b -q 10 AT2-N704-N503.bam &gt; ../processedbamfiles/AT2-N704-N503.qfiltered10.bam

samtools view -b -q 10 AT2-N705-N501.bam &gt; ../processedbamfiles/AT2-N705-N501.qfiltered10.bam
samtools view -b -q 10 AT2-N705-N502.bam &gt; ../processedbamfiles/AT2-N705-N502.qfiltered10.bam
samtools view -b -q 10 AT2-N705-N503.bam &gt; ../processedbamfiles/AT2-N705-N503.qfiltered10.bam

samtools view -b -q 10 AT2-N706-N501.bam &gt; ../processedbamfiles/AT2-N706-N501.qfiltered10.bam
samtools view -b -q 10 AT2-N706-N502.bam &gt; ../processedbamfiles/AT2-N706-N502.qfiltered10.bam
samtools view -b -q 10 AT2-N706-N503.bam &gt; ../processedbamfiles/AT2-N706-N503.qfiltered10.bam
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Index filtered bam files</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-bash">cd /home/hjshim/d/shared_data/internal_restricted/atacseq_Luca_PiqueRegi/processedbamfiles/

samtools index AT2-N701-N501.qfiltered10.bam
samtools index AT2-N701-N502.qfiltered10.bam
samtools index AT2-N701-N503.qfiltered10.bam

samtools index AT2-N702-N501.qfiltered10.bam
samtools index AT2-N702-N502.qfiltered10.bam
samtools index AT2-N702-N503.qfiltered10.bam

samtools index AT2-N703-N501.qfiltered10.bam
samtools index AT2-N703-N502.qfiltered10.bam
samtools index AT2-N703-N503.qfiltered10.bam

samtools index AT2-N704-N501.qfiltered10.bam
samtools index AT2-N704-N502.qfiltered10.bam
samtools index AT2-N704-N503.qfiltered10.bam

samtools index AT2-N705-N501.qfiltered10.bam
samtools index AT2-N705-N502.qfiltered10.bam
samtools index AT2-N705-N503.qfiltered10.bam

samtools index AT2-N706-N501.qfiltered10.bam
samtools index AT2-N706-N502.qfiltered10.bam
samtools index AT2-N706-N503.qfiltered10.bam
</pre>
</div>
</div>
</div>
